Repository: MultiX0/questra-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Questra
ar: كويسترا

# welcomeMessage
source: Welcome to Questra!
ar: ! مرحبًا بك في كويسترا

# firstPageTitle
source: Level Up Your Life!
ar: ! ارفع مستوى حياتك

# firstPageSubtitle
source: Embark on your personalized quest journey now
ar: انطلق في رحلتك الخاصة الآن

# firstPageButtonTitle
source: Level up!
ar: ارْتَقِ!

# firstPageTermsPart1
source: By clicking the login button, you agree to
ar: بالنقر على زر تسجيل الدخول، فإنك توافق على

# firstPageTermsPart2
source: Terms
ar: الشروط

# firstPageTermsPart3
source: and
ar: و

# firstPageTermsPart4
source: Privacy policy
ar: سياسة الخصوصية

# terms_of_use_title
source: Terms of Use
ar: شروط الاستخدام

# terms_acceptance_title
source: 1. Acceptance of Terms
ar: 1. قبول الشروط

# terms_acceptance_content_1
source: By accessing or using Questra ("Service"), you:
ar: من خلال الوصول إلى أو استخدام Questra ("الخدمة"), أنت:

# terms_acceptance_content_2
source: - Confirm you are at least 13 years old
ar: - تؤكد أنك تبلغ من العمر 13 عامًا أو أكثر

# terms_acceptance_content_3
source: - Agree to be bound by these Terms
ar: - توافق على الالتزام بهذه الشروط

# terms_acceptance_content_4
source: - Acknowledge our Privacy Policy
ar: - تقر بسياسة الخصوصية الخاصة بنا

# terms_acceptance_content_5
source: - Accept responsibility for all activities
ar: - تتحمل المسؤولية عن جميع الأنشطة التي تتم تحت حسابك

# terms_acceptance_content_6
source: If disagreeing with terms, you must immediately cease use.
ar: في حال كنت لا توافق على الشروط، يجب عليك التوقف عن استخدام الخدمة فورًا.

# account_responsibilities_title
source: 2. Account Responsibilities
ar: 2. مسؤوليات الحساب

# account_responsibilities_content_1
source: You are solely responsible for:
ar: أنت المسؤول الوحيد عن:

# account_responsibilities_content_2
source: - Maintaining account confidentiality
ar: - الحفاظ على سرية بيانات حسابك

# account_responsibilities_content_3
source: - All activities under your account
ar: - جميع الأنشطة التي تتم تحت حسابك

# account_responsibilities_content_4
source: - Providing accurate information
ar: - تقديم معلومات صحيحة ودقيقة

# account_responsibilities_content_5
source: - Compliance with applicable laws
ar: - الالتزام بالقوانين المعمول بها

# account_responsibilities_content_6
source: - Any content you create/share
ar: - أي محتوى تقوم بإنشائه أو مشاركته

# account_responsibilities_content_7
source: Immediately notify us of unauthorized use.
ar: يجب عليك إبلاغنا فورًا إذا تم استخدام حسابك بدون إذن منك.

# service_modifications_title
source: 3. Service Modifications
ar: 3. تعديل الخدمة

# service_modifications_content_1
source: We reserve the right to:
ar: نحتفظ بالحق في:

# service_modifications_content_2
source: - Modify or discontinue Service at any time
ar: - تعديل أو إيقاف الخدمة في أي وقت

# service_modifications_content_3
source: - Change pricing structure
ar: - تغيير هيكل التسعير

# service_modifications_content_4
source: - Limit/terminate free tier access
ar: - تقييد أو إنهاء الوصول إلى النسخة المجانية

# service_modifications_content_5
source: - Update Terms without notice
ar: - تحديث الشروط دون إشعار مسبق

# service_modifications_content_6
source: Continued use constitutes acceptance of changes.
ar: يعد استمرارك في استخدام الخدمة قبولًا منك بالتغييرات.

# user_content_title
source: 4. User Content
ar: 4. المحتوى المقدم من المستخدم

# user_content_content_1
source: You retain ownership but grant us:
ar: تحتفظ بحقوق ملكية المحتوى الذي تقدمه، ولكنك تمنحنا:

# user_content_content_2
source: - Worldwide, non-exclusive license
ar: - ترخيصًا غير حصري وعالمي

# user_content_content_3
source: - Right to use, copy, and display content
ar: - الحق في استخدام ونسخ وعرض المحتوى

# user_content_content_4
source: - Right to analyze for service improvement
ar: - الحق في تحليله لتحسين الخدمة

# user_content_content_5
source: Prohibited content includes:
ar: المحتوى المحظور يشمل:

# user_content_content_6
source: - Illegal or infringing material
ar: - المواد غير القانونية أو التي تنتهك حقوق الآخرين

# user_content_content_7
source: - Malware/spam
ar: - البرمجيات الخبيثة أو الرسائل المزعجة

# user_content_content_8
source: - NSFW or harmful content
ar: - المحتوى غير اللائق أو الضار

# limitation_of_liability_title
source: 5. Limitation of Liability
ar: 5. تحديد المسؤولية

# limitation_of_liability_content_1
source: To the maximum extent permitted by law:
ar: إلى أقصى حد يسمح به القانون:

# limitation_of_liability_content_2
source: - We exclude all warranties
ar: - نحن نستبعد جميع الضمانات

# limitation_of_liability_content_3
source: - Not liable for indirect damages
ar: - نحن غير مسؤولين عن الأضرار غير المباشرة

# limitation_of_liability_content_4
source: - Not liable for data loss
ar: - نحن غير مسؤولين عن فقدان البيانات

# limitation_of_liability_content_5
source: - Not liable for service interruptions
ar: - نحن غير مسؤولين عن انقطاع الخدمة

# limitation_of_liability_content_6
source: - Not liable for third-party actions
ar: - نحن غير مسؤولين عن تصرفات الأطراف الثالثة

# limitation_of_liability_content_7
source: Total liability limited to fees paid.
ar: المسؤولية الإجمالية تكون محدودة بالمبالغ المدفوعة مقابل الخدمة.

# termination_title
source: 6. Termination
ar: 6. إنهاء الحساب

# termination_content_1
source: We may terminate access for:
ar: يمكننا إنهاء الوصول إلى الخدمة في الحالات التالية:

# termination_content_2
source: - Violations of these Terms
ar: - في حالة مخالفة هذه الشروط

# termination_content_3
source: - Security reasons
ar: - لأسباب أمنية

# termination_content_4
source: - Inactive accounts (6+ months)
ar: - في حالة الحسابات غير النشطة لمدة تزيد عن 6 أشهر

# termination_content_5
source: - Any reason without notice
ar: - لأي سبب آخر دون إشعار مسبق

# termination_content_6
source: Termination results in:
ar: نتيجة للإلغاء، سيتم:

# termination_content_7
source: - Loss of XP and virtual items
ar: - فقدان النقاط والتقدم الافتراضي

# termination_content_8
source: - Account deletion
ar: - حذف الحساب

# termination_content_9
source: - Forfeiture of subscriptions
ar: - سحب الاشتراكات المدفوعة

# privacy_policy_title
source: Privacy Policy
ar: سياسة الخصوصية

# information_we_collect_title
source: 1. Information We Collect
ar: 1. المعلومات التي نقوم بجمعها

# information_we_collect_content_1
source: We may collect the following personal information:
ar: قد نقوم بجمع المعلومات الشخصية التالية:

# information_we_collect_content_2
source: - Email address
ar: - عنوان البريد الإلكتروني

# information_we_collect_content_3
source: - Name and account credentials
ar: - الاسم وبيانات الحساب

# information_we_collect_content_4
source: - Birth date and gender
ar: - تاريخ الميلاد والجنس

# information_we_collect_content_5
source: - Activity level and fitness goals
ar: - مستوى النشاط والأهداف الصحية

# information_we_collect_content_6
source: - Geolocation data (when required for features)
ar: - بيانات الموقع الجغرافي (عند الحاجة لبعض الميزات)

# information_we_collect_content_7
source: - User-generated content including quest photos
ar: - المحتوى الذي ينشئه المستخدم بما في ذلك صور المهام

# information_we_collect_content_8
source: - Device information and usage statistics
ar: - معلومات الجهاز وإحصائيات الاستخدام

# use_of_information_title
source: 2. Use of Information
ar: 2. استخدام المعلومات

# use_of_information_content_1
source: Collected data is used to:
ar: يتم استخدام البيانات التي يتم جمعها من أجل:

# use_of_information_content_2
source: - Provide and maintain the Service
ar: - تقديم وصيانة الخدمة

# use_of_information_content_3
source: - Improve AI models and personalization
ar: - تحسين نماذج الذكاء الاصطناعي والتخصيص

# use_of_information_content_4
source: - Develop new features and functionality
ar: - تطوير ميزات جديدة ووظائف إضافية

# use_of_information_content_5
source: - Deliver targeted advertisements
ar: - تقديم إعلانات مستهدفة

# use_of_information_content_6
source: - Conduct research and analysis
ar: - إجراء الأبحاث والتحليلات

# use_of_information_content_7
source: - Prevent fraud and ensure security
ar: - منع الاحتيال وضمان الأمان

# use_of_information_content_8
source: We do not sell your personal data to third parties.
ar: نحن لا نبيع بياناتك الشخصية إلى أطراف ثالثة.

# data_sharing_title
source: 3. Data Sharing
ar: 3. مشاركة البيانات

# data_sharing_content_1
source: We may share information with:
ar: قد نقوم بمشاركة المعلومات مع:

# data_sharing_content_2
source: - Service providers and contractors
ar: - مقدمي الخدمات والمقاولين

# data_sharing_content_3
source: - Legal authorities when required
ar: - السلطات القانونية عند الحاجة

# data_sharing_content_4
source: - Business partners (anonymous aggregate only)
ar: - الشركاء التجاريين (بشكل مجهول ومجمع فقط)

# data_sharing_content_5
source: - Successors in case of merger/acquisition
ar: - الشركات التابعة في حالة الاندماج أو الاستحواذ

# data_sharing_content_6
source: Third parties are contractually bound to protect your data.
ar: الأطراف الثالثة ملزمة بموجب عقد بحماية بياناتك.

# data_security_title
source: 4. Data Security
ar: 4. أمن البيانات

# data_security_content_1
source: Security measures include:
ar: تشمل تدابير الأمان ما يلي:

# data_security_content_2
source: - AES-256 encryption at rest and in transit
ar: - تشفير AES-256 أثناء الراحة وأثناء النقل

# data_security_content_3
source: - Regular security audits
ar: - تدقيقات أمنية منتظمة

# data_security_content_4
source: - Access controls and 2FA
ar: - ضوابط الوصول والمصادقة الثنائية (2FA)

# data_security_content_5
source: - Anonymization where possible
ar: - إخفاء الهوية حيثما كان ذلك ممكنًا

# data_security_content_6
source: While we implement industry standards, no system is 100% secure.
ar: على الرغم من تنفيذنا لمعايير الصناعة، إلا أنه لا يوجد نظام آمن 100%.

# your_rights_title
source: 5. Your Rights
ar: 5. حقوقك

# your_rights_content_1
source: You have the right to:
ar: لديك الحق في:

# your_rights_content_2
source: - Access your personal data
ar: - الوصول إلى بياناتك الشخصية

# your_rights_content_3
source: - Request data deletion
ar: - طلب حذف البيانات

# your_rights_content_4
source: - Update/correct inaccuracies
ar: - تحديث أو تصحيح الأخطاء

# your_rights_content_5
source: - Opt-out of data collection
ar: - الانسحاب من جمع البيانات

# your_rights_content_6
source: - Export your data
ar: - تصدير بياناتك

# your_rights_content_7
source: - Withdraw consent
ar: - سحب الموافقة

# your_rights_content_8
source: Submit requests to: privacy@devaven.com
ar: يمكنك إرسال الطلبات إلى: privacy@devaven.com

# policy_changes_title
source: 6. Policy Changes
ar: 6. تغييرات السياسة

# policy_changes_content_1
source: We may update this policy:
ar: قد نقوم بتحديث هذه السياسة:

# policy_changes_content_2
source: - Changes effective immediately upon posting
ar: - التغييرات تصبح سارية المفعول فور نشرها

# policy_changes_content_3
source: - No obligation to notify users individually
ar: - لا يوجد التزام بإخطار المستخدمين بشكل فردي

# policy_changes_content_4
source: - Continued use constitutes acceptance
ar: - استمرار الاستخدام يشكل قبولًا بالتغييرات

# policy_changes_content_5
source: - Historical versions available on request
ar: - النسخ السابقة متوفرة عند الطلب

# legal_copyright
source: Questra. All rights reserved.
ar: جميع الحقوق محفوظة لـ كويسترا.

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: Last Updated:
ar: آخر تحديث:

source: Full name
ar: الاسم الكامل

# player_name_hint
source: Player name ...
ar: اسم اللاعب ...

source: Username
ar: اسم المستخدم

# player_username_hint
source: Player username (unique) e.g: multix...
ar: اسم المستخدم (فريد) مثل: multix...

source: Birthday
ar: تاريخ الميلاد

# player_birthday_hint
source: Player Birthday ...
ar: تاريخ ميلاد اللاعب ...

source: Gender
ar: الجنس

# player_gender_hint
source: Player Gender ...
ar: جنس اللاعب ...

source: Fitness/Activity
ar: اللياقة البدنية/النشاط

# general_fitness_activity_hint
source: General fitness/activity level
ar: مستوى اللياقة البدنية/النشاط العام

source: Select Gender
ar: اختر الجنس

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Select fitness/activity level
ar: اختر مستوى اللياقة البدنية/النشاط

source: Sedentary
ar: قليل النشاط

source: Lightly active
ar: نشاط خفيف

source: Moderately active
ar: نشاط معتدل

source: Very active
ar: نشاط عالي

source: Athletic
ar: رياضي

source: Please enter valid name
ar: يرجى إدخال اسم صالح

# name_should_be_more_than_4_characters
source: The name should contain at least 4 characters
ar: يجب أن يحتوي الاسم على 4 أحرف على الأقل

# enter_valid_username
source: Enter valid username please
ar: يرجى إدخال اسم مستخدم صالح

# username_should_be_more_than_4_characters
source: The username should contain at least 4 characters
ar: يجب أن يحتوي اسم المستخدم على 4 أحرف على الأقل

# please_enter_birth_date
source: Please enter your birth date
ar: يرجى إدخال تاريخ ميلادك

# please_select_gender
source: Please select your gender
ar: يرجى اختيار جنسك

# please_select_fitness_activity_level
source: Please select your fitness/activity level
ar: يرجى اختيار مستوى لياقتك البدنية/نشاطك

# the_username_is_taken
source: The username ({username}) is already taken
ar: اسم المستخدم ({username}) محجوز بالفعل

# please_fill_all_fields
source: Please fill all the fields!
ar: يرجى ملء جميع الحقول!

# on_boarding_title
source: Be a player now!
ar: !كن لاعبًا الآن

# on_boarding_subtitle
source: Join the adventure! Share your details to get personalized quests and start leveling up!
ar: !انضم إلى المغامرة! قم بتعبئة بياناتك للحصول على مهام مناسبة لذوقك والبدء في الارتقاء إلى مستويات أعلى

source: Preferences
ar: التفضيلات

source: Social Interactions
ar: التفاعلات الاجتماعية

source: Select social interactions
ar: حدد التفاعلات الاجتماعية

# gamified_social_challenges
source: Solo Explorer
ar: المستكشف الفردي

# story_driven_social_quests
source: Friendly Collaborator
ar: مهام اجتماعية

# community_based_engagement
source: Friendly Collaborator
ar: المتعاون الودود

# simulated_social_scenarios
source: Competitive Challenger
ar: المتحدي التنافسي

# virtual_collaboration
source: Casual Engager
ar: المشارك العادي

# interactive_forums_or_chatrooms
source: Silent Observer
ar: المراقب الصامت

# acts_of_kindness
source: Troll Master
ar: سيد المزاح

source: Real-World Social Prompts
ar: موجهات اجتماعية من العالم الحقيقي

source: Availability
ar: التوفر

source: Select availability per day
ar: حدد التوفر يوميًا

source: More than 1 hour
ar: أكثر من ساعة

source: Less than 1 hour
ar: أقل من ساعة

source: Exactly 1 hour
ar: ساعة بالضبط

source: Difficulty
ar: الصعوبة

source: Select quests difficulty
ar: حدد صعوبة المهام

source: Easy
ar: سهل

source: Medium
ar: متوسط

source: Hard
ar: صعب

source: Please select your social interactions
ar: يرجى تحديد تفاعلاتك الاجتماعية

source: Please select your availability
ar: يرجى تحديد توافرك

source: Please select your difficulty
ar: يرجى تحديد صعوبتك

# social_interactions_hint
source: e.g (Cooperative)
ar: على سبيل المثال (تعاوني)

# availability_hint
source: e.g (1 hour per day)
ar: على سبيل المثال (ساعة واحدة يوميًا)

# difficulty_hint
source: e.g (Medium)
ar: على سبيل المثال (متوسط)

# social_interactions_label
source: social interactions
ar: التفاعلات الاجتماعية

# availability_label
source: availability
ar: التوفر

# difficulty_label
source: difficulty
ar: الصعوبة

# next_button
source: Next
ar: التالي

# report_quest
source: Report a Quest
ar: الإبلاغ عن مهمة

# submitted_at
source: submitted at {date}
ar: تم التقديم في {date}

source: NOTHING HERE!
ar: لا شيء هنا!

# no_mission_completed
source: This player has not completed the mission even once yet.
ar: لم يكمل هذا اللاعب المهمة حتى مرة واحدة بعد.

source: refresh
ar: تحديث

source: report
ar: ابلاغ

source: Confirm Report
ar: تأكيد التقرير

# report_confirmation_message
source: Are you sure you want to report this player? Reports should only be submitted for valid reasons. False reports may lead to penalties.
ar: هل أنت متأكد من أنك تريد الإبلاغ عن هذا اللاعب؟ يجب تقديم التقارير فقط لأسباب مشروعة. التقارير الكاذبة قد تؤدي إلى عقوبات.

source: Cancel
ar: إلغاء

# confirm_and_report
source: Confirm & Report
ar: تأكيد والإبلاغ

source: Show menu
ar: عرض القائمة

source: False completion claim
ar: ادعاء إتمام غير صحيح

source: Unrelated proof image
ar: صورة الاثبات ليس لها صلة بالموضوع

source: Cheating or unfair play
ar: غش أو لعب غير عادل

source: Inappropriate content
ar: محتوى غير مناسب

source: Spam or fake quest
ar: مهام مزيفة أو رسائل غير مرغوب فيها

source: Harassment or abuse
ar: تحرش أو إساءة

source: Feedback
ar: التعليقات

# feedback_hint
source: hint: Your feedback helps the system to understand more about your needs to make better quests for you.
ar: تلميح: يساعد تعليقك النظام على فهم المزيد عن احتياجاتك لتحسين المهام التي نقدمها لك.

source: Please fill the feedback type
ar: الرجاء ملء نوع التعليق

source: Please fill the feedback field
ar: الرجاء ملء حقل التعليق

source: Select feedback type
ar: اختيار نوع التعليق

source: Please enter your feedback here ...
ar: الرجاء إدخال تعليقاتك هنا ...

source: Difficulty Level
ar: مستوى الصعوبة

source: Relevance
ar: الملاءمة

source: Time Required
ar: الوقت المطلوب

source: Rewards
ar: المكافآت

source: Clarity
ar: الوضوح

source: Engagement
ar: التفاعل

source: Other Suggestions
ar: اقتراحات أخرى

source: Christianity
ar: المسيحية

source: Islam
ar: الإسلام

source: Hinduism
ar: الهندوسية

source: Buddhism
ar: البوذية

source: Judaism
ar: اليهودية

source: Atheist
ar: ملحد

source: Choose your religion
ar: اختر ديانتك

source: done
ar: تم

source: it seems we facing an error please try again
ar: يبدو أننا نواجه خطأً، يرجى المحاولة مرة أخرى لاحقا

source: System
ar: النظام

# settings_up
source: We prepare
ar: نقوم

source: your
ar: بتجهيز

source: account
ar: حسابك

source: Goal
ar: هدف

# enter_your_goals
source: enter your goals (very importnant)
ar: أدخل أهدافك (مهم جدًا)

# goals_alert
source: add at least 4 clear goals with specific content, (you can edit or add new goals later)
ar: أضف 4 أهداف واضحة على الأقل بمحتوى محدد، (يمكنك ازالة أو إضافة أهداف جديدة لاحقًا)

source: Quest types
ar: أنواع المهام

source: You need to select 5 to 8 quest types
ar: يجب عليك اختيار من 5 إلى 8 أنواع من المهام

source: Error
ar: خطأ

# marketplace_title
source: Marketplace
ar: متجر الأغراض

# marketplace_subtitle
source: Discover exclusive items, power-ups, and gear to level up your journey. Spend your coins and enhance your adventure!
ar: ! اكتشف العناصر الحصرية، والتعزيزات، والمعدات التي سترتقي برحلتك إلى مستوى جديد. أنفق عملاتك وطوّر مغامرتك

source: Active Title
ar: اللقب النشط

source: Rank
ar: الترتيب

source: Coins
ar: العملات

source: Quest Title
ar: عنوان المهمة

source: Description
ar: الوصف

source: Quest
ar: مهمة

source: Custom Quest
ar: مهمة خاصة

# custom_quest_empty
source: You don’t have any custom quests right now. Would you like to add a new quest?
ar: ليس لديك أي مهام خاصة حاليًا. هل ترغب في إضافة مهمة جديدة؟

# add_quest
source: add quests
ar: اضافة مهمة

# custom_quest_requirements
source: You need to reach level 5 to be able to create your own quests.
ar: يجب أن تصل إلى المستوى 5 لتتمكن من إنشاء مهامك الخاصة.

# custom_quest_level_locked
source: Locked (opens at LVL 5)
ar: مغلق (يفتح عند المستوى 5)

source: Quests Archive
ar: أرشيف المهام

source: Quests
ar: المهام

source: Title
ar: العنوان

# quest_status
source: Status
ar: الحاله

# empty_quest_archive
source: There is no quests in the archive for now
ar: أرشيف المهام فارغ حاليًا

source: view more
ar: عرض المزيد

# empty_quests
source: You don’t have any active quests right now. Would you like to embark on a new quest? (using ai)
ar: ليس لديك أي مهام نشطة حاليًا. هل ترغب في الانطلاق في مهمة جديدة؟

# quest_generation_toast
source: making new quest for you
ar: إنشاء مهام جديدة لك

# wait_until
source: you need to wait until
ar: يجب عليك الانتظار حتى

# quest_finished
source: Finished
ar: أكملتها بنجاح

# quest_failed
source: Failed
ar: لم أتمكن من اكمالها

# quest_status_card_title
source: Quest Status is ?
ar: هل تمكنت من انهاء المهمة؟

# quest_complete_confirmation
source: Are You Sure You’ve Completed the Quest?
ar: هل أنت متأكد أنك أكملت المهمة؟

# quest_finish_alert1
source: Completing a quest is an honorable achievement! However, if you claim completion without truly finishing, you may face penalties
ar: إكمال المهمة هو إنجاز شرفي! ومع ذلك، إذا ادعيت إتمام المهمة دون أن تكملها بالفعل، فقد تواجه عقوبات.

# quest_finish_alert2
source: · Lose Your Current Streak. · Forfeit Earned XP. · Block your account!
ar: · فقدان تقدمك الحالي. · فقدان نقاط الخبرة المكتسبة. · حظر حسابك!

# quest_finish_alert3
source: · Be honest, adventurer—your reputation and progress depend on it. Are you ready to confirm quest completion?
ar: · كن صريحًا، أيها المغامر—سمعتك وتقدمك يعتمدان على ذلك. هل أنت مستعد لتأكيد إتمام المهمة؟

# quest_finish_btn1
source: Yes, I’ve Completed It
ar: نعم، لقد أكملتها.

# quest_finish_btn2
source: No, I’ll Keep Working
ar: لا، سأستمر في العمل عليها.

# image_upload_count_alert
source: You need to add at least {minImagesCount} photos.
ar: يجب عليك إضافة على الأقل {minImagesCount} صور.

# image_submit_card_title
source: Provide some pictures from your results please.
ar: يرجى تقديم بعض الصور من نتائجك.

# image_submit_card_note
source: Note: for more safety for your account from false reports we suggest at least to select one image for the quest that you've done.
ar: ملاحظة: لضمان مزيد من الأمان لحسابك وحمايته من البلاغات الكاذبة، نوصي باختيار صورة واحدة على الأقل للمهمة التي أنجزتها.

source: Free Coins ?
ar: عملات مجانية؟

# free_coins_amount
source: {amount} coins per AD
ar: {amount} عملة لكل إعلان

# free_coins_button
source: Yes
ar: مشاهدة

# marketplace_categories
source: Categories
ar: الفئات

source: soon
ar: سيتوفر قريبا

# marketplace_item_locked_toast
source: this item is locked for now
ar: تم قفل هذا العنصر حاليًا.

# marketplace_item_locked
source: Locked
ar: مقفل

# marketplace_empty
source: There is no items
ar: لاتوجد عناصر حتى الأن

source: Buy
ar: اشتر

source: cost
ar: التكلفة

# buy_btn
source: Buy
ar: شراء

source: Profile
ar: الملف الشخصي

# profile_custom_quests
source: Custom Quests
ar: المهام الخاصة

# profile_titles
source: Titels
ar: الألقاب

# profile_goals
source: Goals
ar: ألاهداف

# profile_achivments
source: Achivment
ar: الانجازات

# profile_guild
source: Guild
ar: النقابة

# profile_friends
source: Friends
ar: الأصدقاء

# add_goal_alert
source: Goal should be contains at lease 8 characters
ar: يجب أن يحتوي الهدف على 8 أحرف على الأقل.

# add_goal_card_title
source: NEW GOAL!
ar: اضافة هدف جديد!

# add_goal_card_note
source: hint: Your goals help the system to understand more about your needs to make better quests for you.
ar: تلميح: تساعد أهدافك النظام على فهم احتياجاتك بشكل أفضل لإنشاء مهام أكثر ملاءمة لك.

# delete_goal_title
source: Delete Goal
ar: حذف الهدف

# delete_goal_readme
source: readme: Your goals help the system to understand more about your needs to make better quests for you. do you want to delete this goal?
ar: ملاحظة: تساعد أهدافك النظام على فهم احتياجاتك بشكل أفضل لإنشاء مهام أكثر ملاءمة لك. هل ترغب في حذف هذا الهدف؟

# add_goal_hint
source: please enter your goal here
ar: يرجى إدخال هدفك هنا.

# titles_empty
source: There is no titles for now
ar: لا توجد ألقاب حاليًا.

# titles_empty_refresh
source: Refresh
ar: تحديث

# titles_change_title_message
source: do you want to change your current active title?
ar: هل ترغب في تغيير لقبك النشط الحالي؟

source: yes
ar: تأكيد

source: owned at
ar: تم الحصول عليه بتاريخ

source: Leaderboard
ar: لوحة الصدارة

source: Your Rank
ar: ترتيبك

# leaderboard_buttons1
source: Global
ar: عالمي
