Repository: MultiX0/questra-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# leaderboard_buttons2
source: Friends
ar: الأصدقاء

# event_join_title
source: 🌟 Exclusive Event: {title} – Register Now!
ar: 🌟 حدث حصري: {title} – سجّل الآن!

# event_join_subtitle
source: Be part of something special! Join {title} on Questra and experience an unforgettable event filled with unique opportunities. Secure your spot today and stay updated with all the latest details. Don't miss out! 🎉🚀
ar: كن جزءًا من شيء مميز! انضم إلى {title} على Questra واختبر حدثًا لا يُنسى مليئًا بالفرص الفريدة. احجز مكانك اليوم وابقَ على اطلاع بكل التفاصيل الجديدة. لا تفوت الفرصة! 🎉🚀

# event_join_fee
source: registration fee is
ar: رسوم التسجيل هي

# event_register_btn
source: Register Now
ar: سجل الأن

source: Participants
ar: المشاركين

# total_participants
source: Total number of participants
ar: عدد المشاركين الكلي

source: View Quest
ar: تفاصيل المهمة

source: Finish
ar: تسليم المهمة

# player_quests_title
source: Player Quests
ar: مهام اللاعب

source: skip
ar: تخطي المهمة

# delete_custom_quest
source: delete
ar: حذف المهمة

# quest_completetion_card_title
source: Victory Achieved, Hero!
ar: تم تحقيق النصر، أيها البطل!

# quest_completetion_card_description
source: Your dedication and skills have led you to triumph. The realm celebrates your success great rewards await you!
ar: تفانيك ومهاراتك قاداك إلى النصر. المملكة تحتفل بنجاحك، والمكافآت العظيمة في انتظارك!

# quest_completetion_card_reward
source: - Your reward is: {xp_reward}XP, {coin_reward}$ coins
ar: مكافأتك هي: {xp_reward} نقاط خبرة، {coin_reward} عملات

# quest_completetion_card_title_earned
source: - Earned title: {owned_title}
ar: - اللقب المكتسب: {owned_title}

# level_up_description
source: This isn’t just a level-up—it’s proof of your grind, your will, and your power. Weaklings stay the same. You? You evolve.
ar: هذه ليست مجرد ترقية للمستوى—إنها دليل على جهدك، وإرادتك، وقوتك. الضعفاء يبقون كما هم. أما أنت؟ فأنت تتطور.

# lootbox_title
source: WELL, WELL, LOOK WHO GOT LUCKY!
ar: حسنا حسنا حسنا, أنظرو معي من اللذي ابتسم له الحظ اليوم

# lootbox_description
source: What’s this? A loot box? Did the game accidentally mistake you for someone important? Nah, just kidding—you’re obviously a legend.
ar: ما هذا؟ صندوق جوائز؟ هل أخطأ اللعبة وظنت أنك شخص مهم؟ لا، فقط أمزح—أنت بالطبع أسطورة.!

# lootbox_description2
source: 💰 Inside: A glorious stash of coins ($reward). 🎲 Luck is just skill you didn’t plan for.
ar: 💰 في الداخل: مخزون رائع من العملات ({reward}). 🎲 الحظ هو مجرد مهارة لم تكن قد خططت لها.

# lootbox_btn
source: GIMME MY MONEY 💰
ar: أعطني أموالي 💰

# avatar_update
source: Update Your Avatar.
ar: تحديث الصورة الشخصية

# custom_quest_add_appbar_title
source: Add Quest
ar: إضافة مهمة

# custom_quest_add_card_title
source: Quest Details
ar: تفاصيل المهمة

# custom_quest_add_card_note
source: hint: You need to write the quest details accurately in order for it to be accepted by the system.
ar: تلميح: يجب عليك كتابة تفاصيل المهمة بدقة حتى يتم قبولها من قبل النظام.

# custom_quest_add_field_hint
source: please enter your quest details here
ar: يرجى إدخال تفاصيل مهمتك هنا.

# custom_quest_add_toast
source: You need to enter at least 10 characters to be able to create a special quest, and you also need to enter precise details about the quest.
ar: يجب عليك إدخال 10 أحرف على الأقل لإنشاء مهمة خاصة، كما تحتاج إلى إدخال تفاصيل دقيقة حول المهمة.

# custom_quest_add_alert
source: You cannot leave this page while the quest is being created.
ar: لا يمكنك مغادرة هذه الصفحة أثناء إنشاء المهمة.

# last_submit_time_quest
source: Expected finish at: {date}
ar: يرجى تسليم المهمة قبل {date}

# event_quest_finish_alert
source: You need to provide at least {minPicsNeeds} photos
ar: يجب عليك تقديم ما لا يقل عن {minPicsNeeds} صور.

source: Friends
ar: الأصدقاء

source: Requests
ar: الطلبات

# total_friends_count
source: Total Friends
ar: عدد الأصدقاء

# total_friend_requests_count
source: Total Requests
ar: عدد الطلبات

# custom_quest_success
source: The quest has been added successfully.
ar: تمت اضافة المهمة بنجاح

# about_us_title
source: About Us
ar: معلومات عننا

# no_friend_requests
source: You do not have any friend requests at the moment.
ar: لا توجد لديك أي طلبات صداقة حاليا.

# no_friends
source: You do not have any friends at the moment.
ar: لايوجد لديك أي أصدقاء حاليا

# add_friends_btn
source: Add Freinds
ar: اضافة أصدقاء

# ad_block_toast
source: Warning: If you are using any ad blocker or VPN that blocks ads in any way, please turn it off because some features in the app will not be able to work properly.
ar: تحذير: اذا كنت تستخدم أي مانع اعلانات أو vpn يقوم بحظر الاعلانات بأي شكل من الأشكال الرجاء اطفائه لان بعض الخواص في التطبيق لن تتمكن من العمل بشكل صحيح.

# already_friend
source: Friend
ar: صديق

source: Search
ar: بحث

# add_friends_search_hint
source: Enter the username you are looking for.
ar: قم بادخال اسم المستخدم الذي تبحث عنه

# add_friends_empty_state
source: Search results are empty
ar: نتائج البحث فارغة

source: Friendship Status
ar: حالة الصداقة

source: Not Friend
ar: ليس صديق

source: Friend
ar: صديق

source: Pending
ar: قيد الانتظار

source: Requesting You
ar: يطلب صداقتك

source: Cancel Request
ar: إلغاء الطلب

source: Remove Friend
ar: إزالة الصديق

source: Reject
ar: رفض

source: Accept
ar: قبول

source: Shared Quests
ar: المهام المشتركة

# remove_friend_alert
source: Do you want to remove this friend from your account?
ar: هل تريد حذف هذا الصديق من حسابك ؟
